Planned + applied:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_access_context_manager_access_level.access-level["terra_dev_aou_test_2"] will be created
  + resource "google_access_context_manager_access_level" "access-level" {
      + id     = (known after apply)
      + name   = "accessPolicies/228353087260/accessLevels/terra_dev_aou_test_2"
      + parent = "accessPolicies/228353087260"
      + title  = "terra_dev_aou_test_2"

      + basic {
          + combining_function = "AND"

          + conditions {
              + members = [
                  + "serviceAccount:all-of-us-workbench-test@appspot.gserviceaccount.com",
                  + "serviceAccount:leonardo-dev@broad-dsde-dev.iam.gserviceaccount.com",
                  + "serviceAccount:circle-deploy-account@all-of-us-workbench-test.iam.gserviceaccount.com",
                  + "serviceAccount:806222273987-ksinuueghug8u81i36lq8aof266q19hl@developer.gserviceaccount.com",
                ]
            }
        }
    }

  # google_access_context_manager_service_perimeter.ingress-bridge["terra_dev_aou_test_2"] will be created
  + resource "google_access_context_manager_service_perimeter" "ingress-bridge" {
      + create_time    = (known after apply)
      + id             = (known after apply)
      + name           = "accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2_ingress_bridge"
      + parent         = "accessPolicies/228353087260"
      + perimeter_type = "PERIMETER_TYPE_BRIDGE"
      + title          = "terra_dev_aou_test_2_ingress_bridge"
      + update_time    = (known after apply)

      + status {
          + resources = [
              + "projects/952536830403",
              + "projects/366818594012",
            ]
        }
    }

  # google_access_context_manager_service_perimeter.ingress-perimeter["terra_dev_aou_test_2"] will be created
  + resource "google_access_context_manager_service_perimeter" "ingress-perimeter" {
      + create_time    = (known after apply)
      + id             = (known after apply)
      + name           = "accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2_ingress"
      + parent         = "accessPolicies/228353087260"
      + perimeter_type = "PERIMETER_TYPE_REGULAR"
      + title          = "terra_dev_aou_test_2_ingress"
      + update_time    = (known after apply)

      + status {
          + resources           = [
              + "projects/952536830403",
            ]
          + restricted_services = [
              + "container.googleapis.com",
            ]
        }
    }

  # google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] will be created
  + resource "google_access_context_manager_service_perimeter" "service-perimeter" {
      + create_time    = (known after apply)
      + id             = (known after apply)
      + name           = "accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2"
      + parent         = "accessPolicies/228353087260"
      + perimeter_type = "PERIMETER_TYPE_REGULAR"
      + title          = "terra_dev_aou_test_2"
      + update_time    = (known after apply)

      + status {
          + access_levels       = [
              + "accessPolicies/228353087260/accessLevels/terra_dev_aou_test_2",
            ]
          + resources           = [
              + "projects/366818594012",
            ]
          + restricted_services = [
              + "bigquery.googleapis.com",
              + "storage.googleapis.com",
            ]
        }
    }

  # google_folder.folder["terra_dev_aou_test_2"] will be created
  + resource "google_folder" "folder" {
      + create_time     = (known after apply)
      + display_name    = "terra_dev_aou_test_2"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/400176686919"
    }

  # google_folder_iam_binding.admin-billing-manager["terra_dev_aou_test_2"] will be created
  + resource "google_folder_iam_binding" "admin-billing-manager" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:all-of-us-workbench-test@appspot.gserviceaccount.com",
        ]
      + role    = "roles/billing.projectManager"
    }

  # google_folder_iam_binding.admin-bucket-writer["terra_dev_aou_test_2"] will be created
  + resource "google_folder_iam_binding" "admin-bucket-writer" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:all-of-us-workbench-test@appspot.gserviceaccount.com",
        ]
      + role    = "organizations/400176686919/roles/terraBucketWriter"
    }

  # google_folder_iam_binding.admin-monitoring-viewer["terra_dev_aou_test_2"] will be created
  + resource "google_folder_iam_binding" "admin-monitoring-viewer" {
      + etag    = (known after apply)
      + folder  = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:all-of-us-workbench-test@appspot.gserviceaccount.com",
        ]
      + role    = "roles/monitoring.viewer"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_folder.folder["terra_dev_aou_test_2"]: Creating...
google_access_context_manager_access_level.access-level["terra_dev_aou_test_2"]: Creating...
google_access_context_manager_service_perimeter.ingress-perimeter["terra_dev_aou_test_2"]: Creating...
google_access_context_manager_access_level.access-level["terra_dev_aou_test_2"]: Creation complete after 2s [id=accessPolicies/228353087260/accessLevels/terra_dev_aou_test_2]
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"]: Creating...
google_access_context_manager_service_perimeter.ingress-perimeter["terra_dev_aou_test_2"]: Creation complete after 4s [id=accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2_ingress]
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"]: Provisioning with 'local-exec'...
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Executing: ["/bin/sh" "-c" "./create-sam-perimeter-resource.sh dev terra_dev_aou_test_2 228353087260 all-of-us-workbench-test@appspot.gserviceaccount.com"]
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Collecting oauth2client
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec):   Downloading https://files.pythonhosted.org/packages/95/a9/4f25a14d23f0786b64875b91784607c2277eff25d48f915e39ff0cff505a/oauth2client-4.1.3-py2.py3-none-any.whl (98kB)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Requirement already satisfied: pyasn1>=0.1.7 in /usr/lib/python2.7/site-packages (from oauth2client) (0.4.5)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Requirement already satisfied: pyasn1-modules>=0.0.5 in /usr/lib/python2.7/site-packages (from oauth2client) (0.2.5)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Requirement already satisfied: rsa>=3.1.4 in /usr/lib/python2.7/site-packages (from oauth2client) (4.0)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Requirement already satisfied: six>=1.6.1 in /usr/lib/python2.7/site-packages (from oauth2client) (1.12.0)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Requirement already satisfied: httplib2>=0.9.1 in /usr/lib/python2.7/site-packages (from oauth2client) (0.12.3)
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Installing collected packages: oauth2client
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Successfully installed oauth2client-4.1.3
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"] (local-exec): Successfully created service-perimeter resource in Sam.
google_access_context_manager_service_perimeter.service-perimeter["terra_dev_aou_test_2"]: Creation complete after 7s [id=accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2]
google_access_context_manager_service_perimeter.ingress-bridge["terra_dev_aou_test_2"]: Creating...
google_folder.folder["terra_dev_aou_test_2"]: Still creating... [10s elapsed]
google_access_context_manager_service_perimeter.ingress-bridge["terra_dev_aou_test_2"]: Creation complete after 2s [id=accessPolicies/228353087260/servicePerimeters/terra_dev_aou_test_2_ingress_bridge]
google_folder.folder["terra_dev_aou_test_2"]: Creation complete after 13s [id=folders/272722258246]
google_folder_iam_binding.admin-billing-manager["terra_dev_aou_test_2"]: Creating...
google_folder_iam_binding.admin-monitoring-viewer["terra_dev_aou_test_2"]: Creating...
google_folder_iam_binding.admin-bucket-writer["terra_dev_aou_test_2"]: Creating...
google_folder_iam_binding.admin-billing-manager["terra_dev_aou_test_2"]: Creation complete after 6s [id=folders/272722258246/roles/billing.projectManager]
google_folder_iam_binding.admin-bucket-writer["terra_dev_aou_test_2"]: Still creating... [10s elapsed]
google_folder_iam_binding.admin-monitoring-viewer["terra_dev_aou_test_2"]: Still creating... [10s elapsed]
google_folder_iam_binding.admin-monitoring-viewer["terra_dev_aou_test_2"]: Creation complete after 18s [id=folders/272722258246/roles/monitoring.viewer]
google_folder_iam_binding.admin-bucket-writer["terra_dev_aou_test_2"]: Creation complete after 18s [id=folders/272722258246/organizations/400176686919/roles/terraBucketWriter]

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.

```